Tekla Open API Reference for Tekla Structures 2025
AABB.GetCornerPoints Method
 Returns all corner points of the current axis-aligned 3d bounding box.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point[] GetCornerPoints()
Public Function GetCornerPoints As Point()
Return Value
Type: Point[]
All corner points of the current axis-aligned 3d bounding box.
See Also
Reference
AABB Class
Tekla.Structures.Geometry3d Namespace